---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunWinderEndWithStraight
source: html/cd2c7e8c-3d94-1317-3a3d-ad7fd495ab5e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunWinderEndWithStraight Property

"End with Straight Run": Winder end with straight run

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunWinderEndWithStraight { get; }
```